#!/bin/sh
# --------------------------------------------------------------------------------------------------
# システム名    ：
# サブシステム名：
# ファイル名    ：
#
# 概要説明      ：
# --------------------------------------------------------------------------------------------------
# 変更履歴：
# 改定                         変更理由                                               担当者
# 番号  変更日     バージョン  案件/問題   変更内容                                   氏名
# --------------------------------------------------------------------------------------------------
# 001   2017-10-13 ver.1.0.0   INS06202    初版                                       橋本 英雄
# --------------------------------------------------------------------------------------------------

# ===================================================
# ===================================================
#
TODAY=`date "+%Y%m%d%H%M%S"`
T="+%Y/%m/%d %H:%M:%S"

# ===================================================
# 検出対象ログファイル
# ===================================================
TARGET_LOG_PATH="/opt/ap/IBM/WebSphere/AppServer/profiles/AppSrv01/logs/server1/"
TARGET_LOG_FILE="SystemOut.log"
TARGET_LOG="${TARGET_LOG_PATH}${TARGET_LOG_FILE}"

LOGWATCH_LOG_PATH="$(dirname $0)/"
LOGWATCH_LOG_FILE="${LOGWATCH_LOG_PATH}${TODAY}_$(basename ${0} .sh ).log"

# --------------------------------------------------------------------------------------------------
# ログ処理
# --------------------------------------------------------------------------------------------------
logger(){
	echo `date "${T}"` $1 | tee -a ${LOGWATCH_LOG_FILE}
}

# --------------------------------------------------------------------------------------------------
# トラップ処理
# --------------------------------------------------------------------------------------------------
trap_action(){
	status=$?
	logger "INFO : TRAP [$status]"
	exit $status
}

# ===================================================
# 検出文字列
# ===================================================
_error_conditions="ハング"

# ===================================================
# 稼動環境の確認
# ===================================================
if [ "$(uname)" == 'Darwin' ]; then
	OS='Mac'
elif [ "$(expr substr $(uname -s) 1 5)" == 'Linux' ]; then
	OS='Linux'
elif [ "$(expr substr $(uname -s) 1 10)" == 'MINGW32_NT' ]; then
	OS='Cygwin'
else
	echo "Your platform ($(uname -a)) is not supported."
	exit 1
fi

# ===================================================
# 2重起動防止
# ===================================================
if [ ${OS} == 'Linux' ]; then
	_process=`basename $0`
	_pcnt=`pgrep -fo ${_process} | wc -l`
	if [ ${_pcnt} -gt 1 ]; then
  		echo "This script has been running now. proc : ${_pcnt}"
  		exit 1
	fi
fi
# --------------------------------------------------------------------------------------------------
# ログファイルを監視する処理
# --------------------------------------------------------------------------------------------------
hit_action() {
	logger "INFO : START [sendmail_action]"
	while read i
	do
		echo $i | grep -q "${_error_conditions}"
		if [ $? = "0" ];then
			# アクション
			#touch /tmp/hogedetayo
			logger "INFO : アクション: ${i}"
			sendmail_action
		fi
	done
	logger "INFO : END   [sendmail_action][RC=$?]"
}
# --------------------------------------------------------------------------------------------------
# メール送信処理
# --------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------
sendmail_action() {
	logger "INFO : START [sendmail_action]"
	logger "INDO :   MAIL TO:{}"
	logger "INFO : END   [sendmail_action][RC=$?]"
}
# --------------------------------------------------------------------------------------------------
# -n 0            : 末尾から表示する行を0行に、標準出力にしないよう
# -f              : ログローテートされた場合 log.log→ローテート→log.log.2000-10-10 を参照する
# -F              :  same as --follow=name --retry
# --follow=name   : 末尾追加のファイルなので、最終部分の文字を読み続ける(-fと同じ）
#                 : name 指定でファイル削除（やリネーム）時の追跡方法がファイルネーム
# --retry         : ファイルがなくなったことを検知したら再オープンを成功するまで繰り返す
# --------------------------------------------------------------------------------------------------
logger "INFO : ${TARGET_LOG_PATH}"
logger "INFO : ${TARGET_LOG_FILE}"
logger "INFO : ${TARGET_LOG}"
logger "INFO : ${LOGWATCH_LOG_PATH}"
logger "INFO : ${LOGWATCH_LOG_FILE}"
logger "INGO : ${_error_conditions}"


trap 'trap_action' {1,2,3,15}

tail -n 0 --follow=name --retry $TARGET_LOG | hit_action
